{"backend": "tensorflow", "config": [{"config": {"embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 5000], "activity_regularizer": null, "embeddings_constraint": null, "dtype": "float32", "input_dim": 49893, "name": "embedding_1", "mask_zero": false, "embeddings_regularizer": null, "output_dim": 100, "input_length": 5000, "trainable": false}, "class_name": "Embedding"}, {"config": {"kernel_size": [5], "filters": 64, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1], "name": "conv1d_1", "activation": "relu", "bias_constraint": null, "dilation_rate": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "valid", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "padding": "valid", "trainable": true, "pool_size": [5], "strides": [5]}, "class_name": "MaxPooling1D"}, {"config": {"kernel_size": [5], "filters": 64, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1], "name": "conv1d_2", "activation": "relu", "bias_constraint": null, "dilation_rate": [1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "padding": "valid", "use_bias": true}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_2", "padding": "valid", "trainable": true, "pool_size": [5], "strides": [5]}, "class_name": "MaxPooling1D"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "units": 32, "kernel_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_constraint": null, "units": 16, "kernel_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_constraint": null, "units": 6, "kernel_constraint": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.1"}